/// الفترات الزمنية الأساسية في نظام أثر
enum AtharTimePeriod {
  dawn, // الفجر (من الأذان إلى الشروق)
  bakur, // البكور (من الشروق إلى 8:00 ص - أو وقت العمل)
  morning, // الصباح (من 8:00 ص إلى قبيل الظهر بـ 15د)
  noon, // الظهيرة (من أذان الظهر إلى العصر)
  afternoon, // العصر (من أذان العصر إلى المغرب)
  maghrib, // المغرب (من أذان المغرب إلى العشاء)
  isha, // العشاء (من أذان العشاء إلى ما بعده بمدة محددة - 1.5س)
  night, // الليل (من انتهاء فترة العشاء إلى بداية الثلث الأخير)
  lastThird, // الثلث الأخير (السحر)
  undefined, // في حال عدم تطابق أي وقت (أو خطأ)
}

/// لتحديد العلاقة بالصلاة (للتذكيرات والمهام)
enum PrayerRelativeTime {
  before, // قبل الأذان
  after, // بعد الأذان
  iqama, // وقت الإقامة (تقديري)
}

/// الصلوات المعتمدة كمرجعية
enum ReferencePrayer { fajr, sunrise, dhuhr, asr, maghrib, isha }
